sterentev/atdf-device-asm-include/inc/ATtiny104.inc
; ====	PORT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PORTCR bits		------------------------
.equ	BBMB		= 1		; 0x02 - Break-Before-Make Mode Enable for PORTB

; ----------	Register PORTCR bits		------------------------
.equ	BBMA		= 0		; 0x01 - Break-Before-Make Mode Enable for PORTA



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC01		= 1		; 0x02 - Interrupt Sense Control 0 Bit 1
.equ	ISC00		= 0		; 0x01 - Interrupt Sense Control 0 Bit 0

; ----------	Register EIMSK bits		------------------------
.equ	INT0		= 0		; 0x01 - External Interrupt Request 0 Enable

; ----------	Register EIFR bits		------------------------
.equ	INTF0		= 0		; 0x01 - External Interrupt Flag 0

; ----------	Register PCICR bits		------------------------
.equ	PCIE1		= 1		; 0x02 - Pin Change Interrupt Enable 1
.equ	PCIE0		= 0		; 0x01 - Pin Change Interrupt Enable 0

; ----------	Register PCIFR bits		------------------------
.equ	PCIF1		= 1		; 0x02 - Pin Change Interrupt Flag 1
.equ	PCIF0		= 0		; 0x01 - Pin Change Interrupt Flag 0

; ----------	Register PCMSK1 bits		------------------------
.equ	PCINT11		= 3		; 0x08 - Pin Change Enable Mask 1 Bit 3
.equ	PCINT10		= 2		; 0x04 - Pin Change Enable Mask 1 Bit 2
.equ	PCINT9		= 1		; 0x02 - Pin Change Enable Mask 1 Bit 1
.equ	PCINT8		= 0		; 0x01 - Pin Change Enable Mask 1 Bit 0

; ----------	Register PCMSK0 bits		------------------------
.equ	PCINT7		= 7		; 0x80 - Pin Change Enable Mask 0 Bit 7
.equ	PCINT6		= 6		; 0x40 - Pin Change Enable Mask 0 Bit 6
.equ	PCINT5		= 5		; 0x20 - Pin Change Enable Mask 0 Bit 5
.equ	PCINT4		= 4		; 0x10 - Pin Change Enable Mask 0 Bit 4
.equ	PCINT3		= 3		; 0x08 - Pin Change Enable Mask 0 Bit 3
.equ	PCINT2		= 2		; 0x04 - Pin Change Enable Mask 0 Bit 2
.equ	PCINT1		= 1		; 0x02 - Pin Change Enable Mask 0 Bit 1
.equ	PCINT0		= 0		; 0x01 - Pin Change Enable Mask 0 Bit 0



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Compare Output Mode for Channel A bits (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	COM0B_MASK	= 0x30		;      - Compare Output Mode for Channel B bits (2 bits)
.equ	COM0B0		= 4		;          COM0B BIT0 position
.equ	TCCR0A_WGM0_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR0A_WGM00	= 0		;          TCCR0A_WGM0 BIT0 position

; ----------	Register TCCR0B bits		------------------------
.equ	ICNC0		= 7		; 0x80 - Input Capture Noise Canceler
.equ	ICES0		= 6		; 0x40 - Input Capture Edge Select
.equ	TCCR0B_WGM0_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR0B_WGM00	= 3		;          TCCR0B_WGM0 BIT0 position
.equ	CS0_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR0C bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC0B		= 6		; 0x40 - Force Output Compare for Channel B

; ----------	Register TIMSK0 bits		------------------------
.equ	ICIE0		= 5		; 0x20 - Input Capture Interrupt Enable
.equ	OCIE0B		= 2		; 0x04 - Output Compare B Match Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Output Compare A Match Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	ICF0		= 5		; 0x20 - Input Capture Flag
.equ	OCF0B		= 2		; 0x04 - Timer Output Compare Flag 0B
.equ	OCF0A		= 1		; 0x02 - Timer Output Compare Flag 0A
.equ	TOV0		= 0		; 0x01 - Timer Overflow Flag

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer Synchronization Mode
.equ	REMAP		= 1		; 0x02 - Remap Bit for 14 pin part only
.equ	PSR		= 0		; 0x01 - Prescaler Reset



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timer Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timer Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UCSRA bits		------------------------
.equ	RXC		= 7		; 0x80 - USART Receive Complete
.equ	TXC		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE		= 5		; 0x20 - USART Data Register Empty
.equ	FE		= 4		; 0x10 - Framing Error
.equ	DOR		= 3		; 0x08 - Data Overrun
.equ	UPE		= 2		; 0x04 - Parity Error
.equ	U2X		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSRB bits		------------------------
.equ	RXCIE		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN		= 4		; 0x10 - Receiver Enable
.equ	TXEN		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ2		= 2		; 0x04 - Character Size
.equ	RXB8		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB8		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSRC bits		------------------------
.equ	UMSEL_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL0		= 6		;          UMSEL BIT0 position
.equ	UPM_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM0		= 4		;          UPM BIT0 position
.equ	USBS		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ0		= 1		;          UCSZ BIT0 position
.equ	UCPOL		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL	:::: bitfield values
;			0x00		; Asynchronous Operation
;			0x40		; Synchronous Operation
; ::::  UPM	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSRD bits		------------------------
.equ	RXSIE		= 7		; 0x80 - USART RX Start Interrupt Enable
.equ	RXS		= 6		; 0x40 - USART RX Start Flag
.equ	SFDE		= 5		; 0x20 - Start frame detection enable




