sterentev/atdf-device-asm-include/inc/ATtiny104.inc
; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 16
.equ	INT_VECTORS_SIZE	= 0x20
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Reset, Power-on Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	PCINT0		; Pin Change Interrupt Request 0
;	3	PCINT1		; Pin Change Interrupt Request 1
;	4	TIM0_CAPT	; Timer/Counter0 Input Capture
;	5	TIM0_OVF	; Timer/Counter0 Overflow
;	6	TIM0_COMPA	; Timer/Counter Compare Match A
;	7	TIM0_COMPB	; Timer/Counter Compare Match B
;	8	ANA_COMP	; Analog Comparator
;	9	WDT		; Watchdog Time-out
;	10	VLM		; Vcc Voltage Level Monitor
;	11	ADC		; ADC Conversion complete
;	12	USART_RXS	; USART RX Start
;	13	USART_RXC	; USART RX Complete
;	14	USART_DRE	; USART Data register empty
;	15	USART_TXC	; USART Tx Complete



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATtiny104.inc"
;#	
;#	; FUSES BYTE0 byte (addr 0x00)
;#	.set	FUSES_BYTE0	= 0xFF \
;#				  & ~(0 <<SELFPROGEN) \
;#				  & ~(0 <<CKOUT) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(0 <<RSTDISBL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "BYTE0		", FUSES_BYTE0
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Reset, Power-on Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; TIM0_CAPT	 - Timer/Counter0 Input Capture
;#		reti			; TIM0_OVF	 - Timer/Counter0 Overflow
;#		reti			; TIM0_COMPA	 - Timer/Counter Compare Match A
;#		reti			; TIM0_COMPB	 - Timer/Counter Compare Match B
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; WDT		 - Watchdog Time-out
;#		reti			; VLM		 - Vcc Voltage Level Monitor
;#		reti			; ADC		 - ADC Conversion complete
;#		reti			; USART_RXS	 - USART RX Start
;#		reti			; USART_RXC	 - USART RX Complete
;#		reti			; USART_DRE	 - USART Data register empty
;#		reti			; USART_TXC	 - USART Tx Complete
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_SRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_SRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY104_INC_ */

; ************************ END OF FILE *********************************

